In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array(my_data)
d = {'a':10, 'b':20, 'c':30}

In [6]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data =my_data, index =labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(arr, labels)

a    10
b    20
c    30
dtype: int64

In [11]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [12]:
d

{'a': 10, 'b': 20, 'c': 30}

SyntaxError: invalid syntax (<ipython-input-15-4cc5d8d2af09>, line 1)

In [16]:
ser1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'USSR', 'Japan'])

In [17]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [18]:
ser2 = pd.Series([1,2,5,4], ['USA', 'Germany', 'Italy', 'Japan'])

In [19]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [21]:
ser2['Japan']

4

In [22]:
ser3 = pd.Series(data=labels)

In [23]:
ser3

0    a
1    b
2    c
dtype: object

In [24]:
ser3[0]

'a'

In [25]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [26]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [27]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [28]:
ser1[0]

1

In [29]:
from numpy.random import randn

In [30]:
np.random.seed(101)

In [32]:
df = pd.DataFrame(randn(5,4), ['A', 'B','C' ,'D', 'E'],['W', 'X','Y','Z'])

In [33]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [34]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [36]:
type(df['W'])

pandas.core.series.Series

In [37]:
type(df)

pandas.core.frame.DataFrame

In [38]:
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [39]:
df[['W', 'Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [42]:
 df['new'] = df['W'] + df['Y']

In [43]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [47]:
df.drop('new', axis = 1, inplace=True)

In [48]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [50]:
df.drop('E')

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [51]:
df.shape

(5, 4)

In [53]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [54]:
df['Y']

A   -1.706086
B    0.166905
C    0.638787
D   -0.943406
E    0.238127
Name: Y, dtype: float64

In [56]:
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [58]:
df.iloc[0]

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

In [59]:
df.loc['B','Y' ]

0.16690463609281317

In [60]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [61]:
df.loc[['A','B'],['W', 'Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

In [62]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [63]:
df > 0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [64]:
booldf =_

In [65]:
booldf

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [66]:
df[booldf]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [68]:
df[df > 0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [69]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [70]:
df['W'] > 0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [71]:
df[df['W'] > 0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [72]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [74]:
resultdf = df[df['Z' ]< 0]

In [76]:
resultdf['X']

A    1.693723
Name: X, dtype: float64

In [79]:
df[df['W']> 0][['X', 'Z']]

          X         Z
A  1.693723 -1.159119
C  0.072960  0.329646

In [85]:
df[(df['W']>0) | (df['Y']>0.6)]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [81]:
True and False

False

In [82]:
df['W']> 0

A     True
B    False
C     True
D    False
E    False
Name: W, dtype: bool

In [86]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [87]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [89]:
newind = 'CA NY WY OR CO'.split()

In [90]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [93]:
df['States'] = newind

In [95]:
df.set_index('States')

               W         X         Y         Z State
States
CA      0.302665  1.693723 -1.706086 -1.159119    CA
NY     -0.134841  0.390528  0.166905  0.184502    NY
WY      0.807706  0.072960  0.638787  0.329646    WY
OR     -0.497104 -0.754070 -0.943406  0.484752    OR
CO     -0.116773  1.901755  0.238127  1.996652    CO

In [96]:
df

          W         X         Y         Z State States
A  0.302665  1.693723 -1.706086 -1.159119    CA     CA
B -0.134841  0.390528  0.166905  0.184502    NY     NY
C  0.807706  0.072960  0.638787  0.329646    WY     WY
D -0.497104 -0.754070 -0.943406  0.484752    OR     OR
E -0.116773  1.901755  0.238127  1.996652    CO     CO

In [97]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [99]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [100]:
inside

[1, 2, 3, 1, 2, 3]

In [105]:
df = pd.DataFrame(randn(6,2), hier_index,['A', 'B'])

In [106]:
df

             A         B
G1 1  0.147027 -0.479448
   2  0.558769  1.024810
   3 -0.925874  1.862864
G2 1 -1.133817  0.610478
   2  0.386030  2.084019
   3 -0.376519  0.230336

In [107]:
df.loc['G1'].loc[1]

A    0.147027
B   -0.479448
Name: 1, dtype: float64

In [110]:
df.index.names = ['Groups', 'Num']

In [111]:
df

                   A         B
Groups Num
G1     1    0.147027 -0.479448
       2    0.558769  1.024810
       3   -0.925874  1.862864
G2     1   -1.133817  0.610478
       2    0.386030  2.084019
       3   -0.376519  0.230336

In [114]:
df.loc['G2'].loc[2]['B']

2.084018530338962

In [119]:
df.xs(1, level='Num')

               A         B
Groups
G1      0.147027 -0.479448
G2     -1.133817  0.610478

In [128]:
d = {'A': [1,2,np.nan], 'B': [5, np.nan, np.nan], 'C':[1,2,3]}

In [126]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 3, 4]}

In [129]:
pd.DataFrame(d)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [130]:
df = pd.DataFrame(d)

In [131]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [133]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [134]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [140]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [141]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [142]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [145]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [146]:
data = {'Company': ['GOOG', 'GOOG','MSFT', 'MSFT', 'FB', 'FB'],
              'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Car1','Sarah'],
              'Sales':[200, 120, 340, 124, 243, 350]}

In [147]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Car1', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [148]:
df = pd.DataFrame(data)

In [149]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Car1    243
5      FB    Sarah    350

In [151]:
byComp = df.groupby('Company')

In [152]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [153]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [155]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [157]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [158]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [160]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Car1    243
GOOG     Charlie    120
MSFT         Amy    124

In [163]:
df.groupby('Company').describe().transpose()['FB']

       count   mean        std    min     25%    50%     75%    max
Sales    2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0

In [166]:
df = pd.DataFrame({'col1': [1,2,3,4],
                                   'col2':[444, 555, 666, 444],
                                   'col3':['abc', 'def', 'ghi', 'xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [170]:
df['col2'].nunique()

3

In [171]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [175]:
df[(df['col1'] > 2) & (df['col2'] == 444
                      )]

   col1  col2 col3
3     4   444  xyz

In [178]:
def times2(x):
    return x * 2

In [180]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [183]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [187]:
df.columns

Index([u'col1', u'col2', u'col3'], dtype='object')

In [188]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [191]:
df.sort_values(by = 'col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [192]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [193]:
data = {'A': ['foo', 'foo','foo', 'bar', 'bar', 'bar'],
               'B': ['one', 'one', 'two', 'two', 'one', 'one'],
               'C': ['x', 'y', 'x', 'y', 'x', 'y'],
               'D': [1,3,2,5,4,1]}

In [194]:
data

{'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
 'B': ['one', 'one', 'two', 'two', 'one', 'one'],
 'C': ['x', 'y', 'x', 'y', 'x', 'y'],
 'D': [1, 3, 2, 5, 4, 1]}

In [197]:
df = pd.DataFrame(data)

In [198]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [199]:
df.pivot_table(values ='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [200]:
pwd

u'/Users/Yusuke/ADMI/Technology/MachineLearning/Python-Data-Science-and-Machine-Learning-Bootcamp/Python-for-Data-Analysis/Pandas'

In [201]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [202]:
df = pd.read_csv('example')

In [208]:
df.to_csv('My_output', index=False)

In [209]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [212]:
pd.read_excel('Excel_Sample.xlsx', sheetname='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [213]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='NewSheet')

In [215]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [216]:
type(data)

list

In [217]:
data

[                                  Bank Name             City  ST   CERT  \
 0             Seaway Bank and Trust Company          Chicago  IL  19328
 1                    Harvest Community Bank       Pennsville  NJ  34951
 2                               Allied Bank         Mulberry  AR     91
 3              The Woodbury Banking Company         Woodbury  GA  11297
 4                    First CornerStone Bank  King of Prussia  PA  35312
 5                        Trust Company Bank          Memphis  TN   9956
 6                North Milwaukee State Bank        Milwaukee  WI  20364
 7                    Hometown National Bank         Longview  WA  35156
 8                       The Bank of Georgia   Peachtree City  GA  35259
 9                              Premier Bank           Denver  CO  34112
 10                           Edgebrook Bank          Chicago  IL  57772
 11                   Doral Bank  En Espanol         San Juan  PR  32102
 12        Capitol City Bank & Trust Company          Atlanta  GA  33938
 13                  Highland Community Bank          Chicago  IL  20290
 14         First National Bank of Crestview        Crestview  FL  17557
 15                       Northern Star Bank          Mankato  MN  34983
 16   Frontier Bank, FSB D/B/A El Paseo Bank      Palm Desert  CA  34738
 17    The National Republic Bank of Chicago          Chicago  IL    916
 18                           NBRS Financial       Rising Sun  MD   4862
 19                    GreenChoice Bank, fsb          Chicago  IL  28462
 20                 Eastside Commercial Bank          Conyers  GA  58125
 21                   The Freedom State Bank          Freedom  OK  12483
 22                              Valley Bank  Fort Lauderdale  FL  21793
 23                              Valley Bank           Moline  IL  10450
 24              Slavie Federal Savings Bank          Bel Air  MD  32368
 25                    Columbia Savings Bank       Cincinnati  OH  32284
 26             AztecAmerica Bank En Espanol           Berwyn  IL  57866
 27                    Allendale County Bank          Fairfax  SC  15062
 28                       Vantage Point Bank          Horsham  PA  58531
 29    Millennium Bank, National Association         Sterling  VA  35096
 ..                                      ...              ...  ..    ...
 519                       ANB Financial, NA      Bentonville  AR  33901
 520                               Hume Bank             Hume  MO   1971
 521                  Douglass National Bank      Kansas City  MO  24660
 522                       Miami Valley Bank         Lakeview  OH  16848
 523                                 NetBank       Alpharetta  GA  32575
 524               Metropolitan Savings Bank       Pittsburgh  PA  35353
 525                         Bank of Ephraim          Ephraim  UT   1249
 526                           Reliance Bank     White Plains  NY  26778
 527   Guaranty National Bank of Tallahassee      Tallahassee  FL  26838
 528                     Dollar Savings Bank           Newark  NJ  31330
 529                    Pulaski Savings Bank     Philadelphia  PA  27203
 530   First National Bank of Blanchardville   Blanchardville  WI  11639
 531                   Southern Pacific Bank         Torrance  CA  27094
 532             Farmers Bank of Cheneyville      Cheneyville  LA  16445
 533                           Bank of Alamo            Alamo  TN   9961
 534  AmTrade International Bank  En Espanol          Atlanta  GA  33784
 535          Universal Federal Savings Bank          Chicago  IL  29355
 536            Connecticut Bank of Commerce         Stamford  CT  19183
 537                        New Century Bank  Shelby Township  MI  34979
 538                   Net 1st National Bank       Boca Raton  FL  26652
 539                            NextBank, NA          Phoenix  AZ  22314
 540                Oakwood Deposit Bank Co.          Oakwood  OH   8966
 541                   Bank of Sierra Blanca    Sierra Blanca  TX  22002
 542           Hamilton Bank, NA  En Espanol            Miami  FL  24382
 543                  Sinclair National Bank         Gravette  AR  34248
 544                      Superior Bank, FSB         Hinsdale  IL  32646
 545                     Malta National Bank            Malta  OH   6629
 546         First Alliance Bank & Trust Co.       Manchester  NH  34264
 547       National State Bank of Metropolis       Metropolis  IL   3815
 548                        Bank of Honolulu         Honolulu  HI  21029

                    Acquiring Institution        Closing Date  \
 0                    State Bank of Texas    January 27, 2017
 1    First-Citizens Bank & Trust Company    January 13, 2017
 2                           Today's Bank  September 23, 2016
 3                            United Bank     August 19, 2016
 4    First-Citizens Bank & Trust Company         May 6, 2016
 5             The Bank of Fayette County      April 29, 2016
 6    First-Citizens Bank & Trust Company      March 11, 2016
 7                         Twin City Bank     October 2, 2015
 8                          Fidelity Bank     October 2, 2015
 9              United Fidelity Bank, fsb       July 10, 2015
 10              Republic Bank of Chicago         May 8, 2015
 11          Banco Popular de Puerto Rico   February 27, 2015
 12   First-Citizens Bank & Trust Company   February 13, 2015
 13             United Fidelity Bank, fsb    January 23, 2015
 14                        First NBC Bank    January 16, 2015
 15                             BankVista   December 19, 2014
 16     Bank of Southern California, N.A.    November 7, 2014
 17                   State Bank of Texas    October 24, 2014
 18                           Howard Bank    October 17, 2014
 19                  Providence Bank, LLC       July 25, 2014
 20             Community & Southern Bank       July 18, 2014
 21       Alva State Bank & Trust Company       June 27, 2014
 22   Landmark Bank, National Association       June 20, 2014
 23                   Great Southern Bank       June 20, 2014
 24                         Bay Bank, FSB        May 30, 2014
 25             United Fidelity Bank, fsb        May 23, 2014
 26              Republic Bank of Chicago        May 16, 2014
 27                   Palmetto State Bank      April 25, 2014
 28                     First Choice Bank   February 28, 2014
 29                  WashingtonFirst Bank   February 28, 2014
 ..                                   ...                 ...
 519       Pulaski Bank and Trust Company         May 9, 2008
 520                        Security Bank       March 7, 2008
 521       Liberty Bank and Trust Company    January 25, 2008
 522         The Citizens Banking Company     October 4, 2007
 523                           ING DIRECT  September 28, 2007
 524  Allegheny Valley Bank of Pittsburgh    February 2, 2007
 525                        Far West Bank       June 25, 2004
 526                     Union State Bank      March 19, 2004
 527              Hancock Bank of Florida      March 12, 2004
 528                          No Acquirer   February 14, 2004
 529                       Earthstar Bank   November 14, 2003
 530                        The Park Bank         May 9, 2003
 531                            Beal Bank    February 7, 2003
 532            Sabine State Bank & Trust   December 17, 2002
 533                          No Acquirer    November 8, 2002
 534                          No Acquirer  September 30, 2002
 535               Chicago Community Bank       June 27, 2002
 536                   Hudson United Bank       June 26, 2002
 537                          No Acquirer      March 28, 2002
 538                       Bank Leumi USA       March 1, 2002
 539                          No Acquirer    February 7, 2002
 540       The State Bank & Trust Company    February 1, 2002
 541     The Security State Bank of Pecos    January 18, 2002
 542     Israel Discount Bank of New York    January 11, 2002
 543                   Delta Trust & Bank   September 7, 2001
 544                Superior Federal, FSB       July 27, 2001
 545                    North Valley Bank         May 3, 2001
 546  Southern New Hampshire Bank & Trust    February 2, 2001
 547              Banterra Bank of Marion   December 14, 2000
 548                   Bank of the Orient    October 13, 2000

            Updated Date
 0     February 17, 2017
 1     February 17, 2017
 2     November 17, 2016
 3     November 17, 2016
 4     September 6, 2016
 5     September 6, 2016
 6         June 16, 2016
 7        April 13, 2016
 8      October 24, 2016
 9       August 17, 2016
 10        July 12, 2016
 11         May 13, 2015
 12       April 21, 2015
 13       April 21, 2015
 14     January 15, 2016
 15      January 6, 2016
 16    November 10, 2016
 17      January 6, 2016
 18       March 26, 2015
 19    December 12, 2016
 20        July 11, 2016
 21       March 25, 2016
 22        June 29, 2015
 23        June 26, 2015
 24    December 12, 2016
 25    November 10, 2016
 26     October 20, 2016
 27        July 18, 2014
 28        March 3, 2015
 29       March 03, 2015
 ..                  ...
 519     August 28, 2012
 520     August 28, 2012
 521    October 26, 2012
 522  September 12, 2016
 523     August 28, 2012
 524    October 27, 2010
 525       April 9, 2008
 526       April 9, 2008
 527        June 5, 2012
 528       April 9, 2008
 529       July 22, 2005
 530        June 5, 2012
 531    October 20, 2008
 532    October 20, 2004
 533      March 18, 2005
 534  September 11, 2006
 535       April 9, 2008
 536   February 14, 2012
 537      March 18, 2005
 538       April 9, 2008
 539    February 5, 2015
 540    October 25, 2012
 541    November 6, 2003
 542  September 21, 2015
 543   February 10, 2004
 544     August 19, 2014
 545   November 18, 2002
 546   February 18, 2003
 547      March 17, 2005
 548      March 17, 2005

 [549 rows x 7 columns]]

In [221]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,"January 27, 2017","February 17, 2017"
1,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,"January 13, 2017","February 17, 2017"
2,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
3,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
4,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"

In [223]:
from sqlalchemy import create_engine

In [224]:
engine = create_engine('sqlite:///:memory:')

In [228]:
df.to_sql('my_table1', engine)

In [229]:
sqldf = pd.read_sql('my_table1', con=engine)

In [230]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15